In [1]:
# pandas
# data structure
# 1. Series 
# 2. DataFrame
# 3. Panel 3

# indexd ( axis =0) , colums (axis =1)

# Series (Immutable)

In [2]:
import pandas as pd
s = pd.Series()
s

Series([], dtype: float64)

In [13]:
import numpy as np
import pandas as pd

data = np.array(['a','b','c','d'])

s1 = pd.Series(data)
s1

s2 = pd.Series(data, index = [100,101,102,103])
s2

data2 = {'a':0, 'b':1, 'c':2, 'd':3}
s3 = pd.Series(data2)
s3

s4 = pd.Series(data2, index = ['b','a','c','e'])
s4[0]
s4['a']

print(s4[2])
print(s4['a'])
s4[:3]
s4[1:]
s4[-3:]
s4[['a','b']]

2.0
0.0

a    0.0
b    1.0
dtype: float64

In [20]:
import pandas as pd
df = pd.DataFrame()
df
data = [1,2,3,4,5,6]
df2 = pd.DataFrame(data)
df2

data2 = [['Tome',2000],['John',3000],['Amy',5000]]
df3 = pd.DataFrame(data2)
df3

df4 = pd.DataFrame(data2, 
                   index = ['one','two','three'],
                   columns = ['Name', 'Salary'], dtype = float)
df4

       Name  Salary
one    Tome  2000.0
two    John  3000.0
three   Amy  5000.0

In [21]:
data3 = {'Name' : ['a','b','c'], 'Salary':['100','200','300']}
df5 = pd.DataFrame(data3)
df5

  Name Salary
0    a    100
1    b    200
2    c    300

In [33]:
data4 = {'one':pd.Series([1,2,3], index = ['a','b','c']),
         'two':pd.Series([1,2,3,4], index = ['a','b','c','d'])}

df6 = pd.DataFrame(data4)
df6
df6['one']
df6['two']
df6['three'] = pd.Series([10,20,30], index = ['b','c','d'])
df6
df6['four'] = df6['one'] +df6['two']
df6

#del df6['one']
#df6

#index, columns
#label, index --> loc, iloc

   one  two  three  four
a  1.0    1    NaN   2.0
b  2.0    2   10.0   4.0
c  3.0    3   20.0   6.0
d  NaN    4   30.0   NaN

In [39]:
#index row selection
#label, index --> loc, iloc row기준
print(df6)
print('=' *50)
print(df6.iloc[0])
print('=' *50)
print(df6.loc['a'])

   one  two  three  four
a  1.0    1    NaN   2.0
b  2.0    2   10.0   4.0
c  3.0    3   20.0   6.0
d  NaN    4   30.0   NaN
==================================================
one      1.0
two      1.0
three    NaN
four     2.0
Name: a, dtype: float64
==================================================
one      1.0
two      1.0
three    NaN
four     2.0
Name: a, dtype: float64

In [45]:
d = df6.iloc[1]
d
type(d)

d2 = pd.DataFrame(d)
type(d2)
d2

          b
one     2.0
two     2.0
three  10.0
four    4.0

In [52]:
#d2.append
df6.drop('a', axis =0)

   one  two  three  four
b  2.0    2   10.0   4.0
c  3.0    3   20.0   6.0
d  NaN    4   30.0   NaN

In [57]:
df7 = pd.DataFrame([[1,2,],[3,4]], columns = ['a','b'])
df8 = pd.DataFrame([[5,6,],[7,8]], columns = ['a','b'])
df9 = df7.append(df8)
print(df9)
df9.drop(0)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

   a  b
1  3  4
1  7  8

In [67]:
#Panel
data = np.random.randn(2,4,5)
data
type(data)
df11 = pd.Panel(data)
df11


data2 = {'one': pd.DataFrame(np.random.randn(4,3)),
        'two': pd.DataFrame(np.random.randn(4,2))}

df12 = pd.Panel(data2)
df12

print(df12['two'])
print(df12['one'])

          0         1   2
0  0.112221  0.433885 NaN
1 -0.771062  0.129806 NaN
2 -0.234126 -0.645523 NaN
3 -0.228188  0.652275 NaN
          0         1         2
0 -0.603936 -0.559007 -1.098467
1 -0.692677  0.154463 -1.392961
2  0.291951 -0.024588  0.545707
3 -0.116076  1.133203  0.111137

In [73]:
import numpy as np
import pandas as pd

s = pd.Series(np.random.randn(4))
s

s.axes
s.empty
s.ndim
s.size

s.values

array([-0.30793029,  1.08890412, -0.50084399, -0.57889642])

In [84]:
data5 = [[1,2,],[3,4]]
df20 = pd.DataFrame(data5)
df20.T
df20.ndim
df20.shape
df20.size
df20.values
df20.head()
df20.info()
df20.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
0    2 non-null int64
1    2 non-null int64
dtypes: int64(2)
memory usage: 112.0 bytes

              0         1
count  2.000000  2.000000
mean   2.000000  3.000000
std    1.414214  1.414214
min    1.000000  2.000000
25%    1.500000  2.500000
50%    2.000000  3.000000
75%    2.500000  3.500000
max    3.000000  4.000000

In [88]:
# element wise function
df20
df20[0].map(lambda x: x*100)

0    100
1    300
Name: 0, dtype: int64

In [93]:
df21 = pd.DataFrame(np.random.randn(10,3), columns = ['col1','col2','col3'])
df22 = pd.DataFrame(np.random.randn(7,3), columns = ['col1','col2','col3'])
df23 = df21.reindex_like(df22)
df24 = df23. rename(columns = {'col1': 'cl1','col2':'cl2'},
            index = {0 : 'one', 2:'two'}) #inplace = True

df24

          cl1       cl2      col3
one  0.213553 -0.207124 -2.871996
1    1.050082 -1.043848  0.654894
two -0.912450  0.086726 -2.469838
3    0.429131 -0.143916  0.655897
4    1.107319 -0.136527 -0.171994
5   -0.177662 -0.769703 -1.720678
6   -0.666724 -0.872640 -0.905458

In [16]:
import pandas as pd
import numpy as np

df =pd.DataFrame({
    'a': pd.date_range(start = '2016-01-01', periods =20, freq = 'D'),
    'y': np.random.randn(20),
    'c': np.random.choice(['low','medium','high'], 20).tolist()
})

df2= df.reindex(index=[0,2], columns =['a','c'])
df2

df3= pd.DataFrame(np.random.randn(10,2),
                 index= [1,4,6,2,3,5,9,8,0,7],
                 columns = ['col1','col2'])
df3

df4= df3.sort_index()
df4

df5= df4.sort_index(ascending= False)
df5

df5.sort_index(axis=1, ascending = False)
df5.sort_values(by='col1')
df5.sort_values(by= ['col1','col2'])


df3.sort_index(axis=1)

       col1      col2
1 -1.260807 -1.322940
4  0.169159 -0.811355
6  0.064160 -0.225259
2 -1.043628 -0.726557
3 -2.152453 -0.040796
5 -0.247518 -0.392825
9 -0.969338 -0.657032
8  0.264348 -0.593028
0  0.785699 -0.369524
7 -0.204652  0.377688

In [38]:
# dataframe
# ['a'] -> column
# iloc[0] -> row select by index
# loc['a'] -> row select by label

df6 = pd.DataFrame(np.random.randn(8,4),
                  index = ['a','b','c','d','e','f','g','h'],
                  columns = ['A','B','C','D'])

df6
df6.iloc[:,1]
df6.loc[:,'A']

df6.loc[:,["A","B"]]
df6.iloc[:,1:]
df6.loc['a']>0
df6.loc['a'][df6.loc['a']>0]


# Series .loc. iloc
# DataFrame .loc[row,column] or iloc[,]

A    0.687436
B    1.987513
Name: a, dtype: float64

In [44]:

a= np.arange(100).reshape(10,10)
a

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34, 35, 36, 37, 38, 39],
       [40, 41, 42, 43, 44, 45, 46, 47, 48, 49],
       [50, 51, 52, 53, 54, 55, 56, 57, 58, 59],
       [60, 61, 62, 63, 64, 65, 66, 67, 68, 69],
       [70, 71, 72, 73, 74, 75, 76, 77, 78, 79],
       [80, 81, 82, 83, 84, 85, 86, 87, 88, 89],
       [90, 91, 92, 93, 94, 95, 96, 97, 98, 99]])

In [64]:
df7 = pd.DataFrame(np.random.randn(5,3)
                  ,index = ['a','c','e','f','h'],
                  columns = ['one','two','three'])
df8= df7.reindex(['a','b','c','d','e','f','g','h'])
df8

#NaN = Not a Number

#Chenk isnull(), notnull()

df8['one'].isnull()
df8['one'].notnull()

df8.isnull()
df8.notnull()
df8.isnull().sum()
#df8['one'].sum()
df8.fillna(0)
#Delete nan = dropna()
df8.dropna()

        one       two     three
a  0.197349 -1.724331 -1.190246
c -1.655901 -1.977905  0.304427
e  2.044768  0.497450  0.552833
f -0.164357  0.331280  1.447303
h -0.376758  1.151043 -0.763459

In [ ]:
# gruopby('key')
# gruopby(['key1','key2'])
# gruopby(axis=1)
# gruopby('key').groups = 항목확인

In [71]:
data = {
    'Team': ['A','B','C','A','B','C','A','A','B','C','A','A'],
    'Rank': [1,2,2,3,4,2,1,2,2,3,4,2],
    'Year': ['2014','2015','2014','2015','2016','2017',
             '2016','2014','2015','2017','2014','2015']
}
df10 = pd.DataFrame(data)
grp = df10.groupby('Team') #filter = having
# transformations
score = lambda x : (x-x.mean())
grp.transform(score)

        Rank
0  -1.166667
1  -0.666667
2  -0.333333
3   0.833333
4   1.333333
5  -0.333333
6  -1.166667
7  -0.166667
8  -0.666667
9   0.666667
10  1.833333
11 -0.166667

In [76]:
import pandas as pd
left = pd.DataFrame({
    'id': [1,2,3,4,5],
    'Name': ['Tom','Amy','John','Young','Andrew'],
    'subject_id': ['sub1','sub2','sub3','sub1','sub2']
})
right = pd.DataFrame({
    'id': [1,2,3,4,5],
    'Name': ['Tom2','Amy2','John2','Young2','Andrew2'],
    'subject_id': ['sub1','sub1','sub4','sub3','sub2']
})

pd.merge(left,right, on = 'id')
pd.merge(left,right, on = ['id','subject_id'])

   id  Name_x subject_id   Name_y
0   1     Tom       sub1     Tom2
1   5  Andrew       sub2  Andrew2

In [77]:
pd.date_range('1/1/2011', periods= 5, freq = 'M')

DatetimeIndex(['2011-01-31', '2011-02-28', '2011-03-31', '2011-04-30',
               '2011-05-31'],
              dtype='datetime64[ns]', freq='M')